# LDevice_ReleaseRes

## Description
Release the resource content and restores the saved selection.

```pascal
PROCEDURE LDevice_ReleaseRes;
```

```python
def vs.LDevice_ReleaseRes():
    return None
```

## Examples
```pascal
LDevice_ReleaseRes;
```
```python
import vs

# Release the resource content and restores the saved selection.
vs.LDevice_ReleaseRes()
```

## Version
Availability: from Vectorworks 2019.2

## Category
* Spotlight